{
  "terms":
    {
      "cavitation": {
          "word": "Cavitation",
          "definition": "Impellers can introduce areas of very low pressure. This can happen at the eye of the impeller or even on the impeller blades. If the pressure in these areas is low enough, such that the pressure is less than the vapor pressure of the liquid being pumped, then the fluid will boil. As the bubbles travel throughout the pump they can pop and actually cause damage to the internal parts of the pump.",
          "links": [
            {
              "title": "Why is Cavitation Damaging your Pumps?",
              "link": "https://www.sintechpumps.com/pump-maintenance/why-is-cavitation-damaging-to-your-pump/"
            },
            {
              "title": "What is Cavitation and How Does it Work? (Youtube)",
              "link": "https://www.youtube.com/watch?v=ey0S66hDq9U&ab_channel=ConcerningReality"
            }
          ]
      },
      "channel": {
          "word": "Channel",
          "definition": "Spacing between the vanes of the impeller. The length of the channel can open and increase radially. This increasing spacing increases pressure according to bernoulli's law.",
          "links": []
      },
      "discharge": {
          "word": "Discharge",
          "definition": "The output section of the pump. Opposite of the inlet/input side.",
          "links": []
      },
      "gland": {
          "word": "Gland/Gland Follower",
          "definition": "The gland follower is used to compress the packing within the stuffing box so that it is harder for fluid to make it through the packing and leak. The gland is usually has a sharp elliptical face where two screws can be placed on both ends of the face. The screws are long and reach all the way to the back cover of the case. A circular extension pushes into the stuffing box, but the actual center of the piece is completely hollow to allow the main shaft to pass through. The tighter the screws, the more the gland will tighten and press into the stuffing box.",
          "links": []
      },
      "impeller": {
          "word": "Impeller",
          "definition": "The impeller is a flat plate, with multiple curved vanes on it's surface, which is spun by a prime mover in a centrifugal pump. This is the workhorse of the centrifugal pump. It rotates rapidly and transfers it's kinetic energy to the fluid. The fluid is flung outward by the rotating vanes of the impeller. This imparted kinetic energy, will ultimately be converted into pressure energy by the volute. The eye of the impeller refers to the center of the impeller which is connected to the input/sucking nozzle of the pump casing. When the impeller vanes throw the internal fluid outward into the vollute, it creates a vacuum/pressure differential at the eye of the impeller. It causes fluid to be pulled in from the input nozzle and into the impeller.",
          "links": [
            {
              "title": "Centrifugal Pump Impellers (Youtube)",
              "link": "https://www.youtube.com/watch?v=I0WsfrUCO0U&t=128s&ab_channel=saVRee"
            }
          ]
      },
      "lanternring": {
          "word": "Lantern Ring",
          "definition": "The packing around the shaft within the stuffing box can get very hot as the main shaft rotates rapidly. The lantern ring provides a means for fluid cooling. It has holes all around it that allow fluid to carry away the heat generated by the rotating shaft.",
          "links": []
      },

      "oring": {
          "word": "O-ring",
          "definition": "An elastic, circular gasket that is placed around the mating of two metals (typically at a flange) that is used to prevent fluid leaks. The O-ring sits inside of a groove and in high pressure situations, the O-ring will deform under the pressure in such a manner to block any fluid from escaping.",
          "links": [
            {
              "title": "Wikipedia - O-Rings",
              "link": "https://en.wikipedia.org/wiki/O-ring"
            },
            {
              "title": "How to Select, Install, and Design O-Rings (Youtube)",
              "link": "https://www.youtube.com/watch?v=aweDWuNkPw0&t=135s&ab_channel=tarkka"
            },
            {
              "title": "What is an O-ring? (Youtube)",
              "link": "https://www.youtube.com/watch?v=s5nJG0om8KY&ab_channel=MykinInc"
            }
          ]
      },
      "primemover": {
          "word": "Prime Mover",
          "definition": "A component which acts as the source of motive power. In the case of a centrifugal pump, this would be the electrical motor that rotates the main shaft.",
          "links": []
      },
      "pumpslip": {
          "word": "Pump Slip",
          "definition": "When the medium or fluid that a pump transfers leaks back to the input side from the output side, this is called pump slip. It leads to inefficiency of the pump. A.K.A Backflow.",
          "links": [
            {
              "title": "Useful Information on Pump Slip",
              "link": "https://www.michael-smith-engineers.co.uk/resources/useful-info/pump-slip"
            }
          ]
      },
      "stuffingbox": {
          "word": "Stuffing Box",
          "definition": "A hollowed out circular cavity within the cover backplate that houses the packing. The shaft has to penetrate the back cover of the case so that it can rotate the impeller. The purpose of the stuffing box is to prevent leaks at the opening of the back case cover. This cavity can also house the lantern ring.",
          "links": []
      },
      "turbine": {
          "word": "Turbine",
          "definition": "A turbine has the opposite effect on a fluid than an impeller. The impeller is a rotor that is designed to increase the pressure of fluid. A turbine is a rotor with the goal of absorbing the energy of the fluid, which, in turn, decreases the fluid pressure.",
          "links": []
      },
      "vane": {
          "word": "Vane",
          "definition": "A narrow piece on the impeller that follows a curved path radially outward. It's goal is to help impart centrifugal force on the fluid and fling it outward. It is attached to the back shroud and sits between the back and front shroud on a closed impeller. There are always multiple vanes on an impeller and the number of vanes that you can have varies per impeller. The number of vanes has an advantage or disadvantage based on the application of the pump and the medium with which the pump will work. Vanes, in conjunction with each other, create channels that help convert fluid energy to pressure energy through bernoulli's principle.",
          "links": []
      },
      "wearring": {
          "word": "Wear Ring",
          "definition": "A removable ring placed at the impeller hub and volute casing interface. The purpose of the ring is to combat slipback of the centrifugal motor. The pressure differential from the discharge to the suction side can cause fluid to leak back into the suction side. This is major inefficiency and can lead to worse problems as the motor continues working. The higher the clearance of the wear ring, the more inefficiency and slip back that occurs. The slip ring should be as flush as possible without limiting rotation of the impeller.",
          "links": [
            {
              "title": "Wear Ring Clearances in Centrifugal Pumps",
              "link": "https://www.pumpworks.com/wear-ring-clearances-in-centrifugal-pumps/"
            }
          ]
      }
    }
}
