{
  "terms":
    {

        "actuator": {
            "word": "Actuator",
            "definition": "Any device or machine that is used to deliver force or torque for the purpose of moving the links that comprise a mechanism.",
            "links": []
        },

        "configuration": {
            "word": "Configuration",
            "definition": "The current orientation and position of a rigid body. It is described by a set of real numbers. For example, the configuration of an object fixed to a plane (2D space), can be described by a minimum of three real independent variables: X and Y for position and theta for its angular orientation. The degrees of freedom is the smallest number of independent variables you need to describe a link's current configuration.",
            "links": []
        },

        "configurationspace": {
            "word": "Configuration Space (C-Space)",
            "definition": "The current configuration of a rigid body is described by a set of real numbers or independent variables. Each independent variable provides a whole range of values that the rigid body can take on. This means that there is a whole range of configurations available to the rigid body. The range/space that all of these possible configurations trace out is known as the Configuration Space, or the C-Space. Every individual configuration is a point within this C-Space. We can take a door as an example. The door is a link connected to the wall, the ground link. They are connected to each other through the door hinge, which is a revolute joint. This joint places a constraint on the door so that it can only move at an angle relative to the wall. We only need a single real number, the door's angle with respect to the wall, to describe the current configuration of the door. Let's say that the wall is parallel with the doorway. This would mean the door can open a full 180 degrees before hitting the wall. The semicircle traced out by the door contains all possible configurations for the door and is thus our configuration space. Every point making up the semicircle is a different configuration for the door.",
            "links": []
        },

        "constraint": {
            "word": "Constraint",
            "definition": "A cosntraint is a restriction placed on the motion of an object within free space. Constraints seek to limit the motion of an object by eliminating dimensions upon which an object can freely move. The more constraints you place on an object, the less degrees of freedom you have.",
            "links": [
              {
                "title": "Youtube - Physics Constraints in Games Part 1 - Constraint Basics",
                "link": "https://www.youtube.com/watch?v=MTVdBgQY9LY&ab_channel=Ming-LunChou"
              }
            ]
        },

        "cylindricaljoint": {
            "word": "Cylindrical (C) Joint",
            "definition": "A lower kinematic pair that constrains the motion of a link in 3D space. A rigid body has 6 degrees of freedom in 3D space. This joint places 4 constraints on one of the links with respect to the ground link, allowing only movement in one linear dimension and one angular dimension. The link can move in a linear fashion in parallel with the same axis that it rotates about for its one-dimensional angular motion. This joint allows for 2 D.O.F.",
            "links": [
              {
                "title": "Wikipedia - Kinematic Pair",
                "link": "https://en.wikipedia.org/wiki/Kinematic_pair"
              },
              {
                "title": "Wikipedia - Cylindrical Joint",
                "link": "https://en.wikipedia.org/wiki/Cylindrical_joint"
              },
              {
                "title": "Cylindrical Joint in CAD",
                "link": "https://www.youtube.com/watch?v=J7ykV88v6PM&ab_channel=AutodeskInventor"
              }
            ]
        },

        "degreesoffreedom": {
            "word": "Degrees of Freedom (D.O.F.)",
            "definition": "The number of independent variables that are needed to fully describe the position of a link or mechanism in space. This is also the dimension of the configuration space. You can calculate the D.O.F. First, take the number of freedoms per body (3 for 2D, 6 for 3D - don't consider ground link) and add them all up for all bodies. Take this sum and subtract from that the number of independent constraints on each body. Take one link attached to a ground link through a revolute joint. The non-ground link has 5 independent constraints placed on it due to the revolute joint. The non-ground link has 6 degrees of freedom in 3D space. 6-5 = 1 degree of freedom for this mechanism.",
            "links": [
              {
                "title": "Lesics - Understanding Degrees of Freedom",
                "link": "https://www.youtube.com/watch?v=vOFM8eG8kVc&ab_channel=Lesics"
              },
              {
                "title": "Dr Joji Thomas - Degrees of Freedom",
                "link": "https://www.youtube.com/watch?v=7zHePdzk_8A&t=216s&ab_channel=DrJojiThomas"
              },
              {
                "title": "Northwestern Robotics - Degrees of Freedom of a Robot",
                "link": "https://www.youtube.com/watch?v=zI64DyaRUvQ&ab_channel=NorthwesternRobotics"
              },
              {
                "title": "Kinematics - The Design of Mechanisms: Degrees of Freedom",
                "link": "https://www.brighthubengineering.com/machine-design/6634-kinematics-design-of-mechanisms-degrees-of-freedom/"
              }
            ]
        },

        "endeffector": {
            "word": "End-Effector",
            "definition": "A device, like a gripping hand, that is used by the robot to manipulate and move objects in its surroundings.",
            "links": []
        },

        "explicitparametrization": {
            "word": "Explicit Parametrization",
            "definition": "Using n parameters to represent an n-dimensional topology or space. Take the surface of a sphere. This is a 2D topology, in which positions on the surface of the sphere can be represented with two numbers, lattitude and longitude. Remember that we are referring to the surface of the sphere here as our topology, which is a curved 2D space. Even though a sphere is a 3D object, its surface, as a topological space, is 2D. This does not mean you can not use more numbers to represent the surface of the sphere. The curved 2D surface of the sphere sits in 3D space. So we can use a standard 3D orthogonal unit vector representation and use x, y, and z to map out points on the surface of the sphere. Using more than n parameters to represent a space is called implicit parametrization.",
            "links": []
        },

        "grublersformula": {
            "word": "Grublers Formula",
            "definition": "An expression to determine the D.O.F. for a mechanism made up of links and joints. The formula is [DoF = m(N-1-J) + (sum of F_i {i goes from 1 to J})]. Here are what the variables represent: [m=freedoms of a rigid body (3 in 2D, 6 in 3D), N=number of links, including ground link, J=number of joints, F_i=number of freedoms given by a joint]. Everything is pretty self-explanatory except for the F_i. Instead of thinking of joints adding constraints and removing freedoms, you can also think of them as giving freedoms. A revolute joint, for example, provides 5 constraints, but also provides 1 freedom. A universal joint provides 4 constaints, but also 2 freedoms. You sum the number of freedoms given by a joint and add that to the first expression in Grubler's formula.",
            "links": [
              {
                "title": "Northwestern Robotics - Degrees of Freedom of a Robot",
                "link": "https://www.youtube.com/watch?v=zI64DyaRUvQ&list=PLggLP4f-rq02vX0OQQ5vrCxbJrzamYDfx&index=5&ab_channel=NorthwesternRobotics"
              }
            ]
        },

        "helicaljoint": {
            "word": "Helical (H) Joint",
            "definition": "A lower kinematic pair that constrains the motion a link in 3D space. A rigid body has 6 degrees of freedom in 3D space. This joint places 5 constraints on the link with the respect to the ground link, allowing only movement in one linear dimension. This is very similar to a prismatic joint, but the linear motion is accomplished through a helical or screwing motion of one of the links. This joint allows for 1 D.O.F.",
            "links": [
              {
                "title": "Wikipedia - Kinematic Pair",
                "link": "https://en.wikipedia.org/wiki/Kinematic_pair"
              },
              {
                "title": "Wikipedia - Helical Joint",
                "link": "https://en.wikipedia.org/wiki/Screw_joint"
              },
              {
                "title": "Video of a Revolute Joint",
                "link": "https://www.youtube.com/watch?v=fZqJopEL-k0&ab_channel=KeyanGhazi-Zahedi"
              }
            ]
        },

        "higherpair": {
            "word": "Higher Pair",
            "definition": "A type of kinematic pair that requires constant contact between the surfaces of two links. This differs from a Lower Pair, in that the two links are not 'locked' into one another. Their surfaces make contact, but they can be pulled apart easily. A cam pushing down the intake and exhaust valves within an engine is a good example. The cam maintains constant contact with the valves as it rotates due to the cam shaft. However, it's a sort of touch contact. The cam is not attached to the valves except through touch. The cam forms a pair or joint with the valves, but they are not physically locked into one another as something like a revolute joint would be.",
            "links": [
              {
                "title": "Wikipedia - Kinematic Pair",
                "link": "https://en.wikipedia.org/wiki/Kinematic_pair"
              }
            ]
        },

        "holonomicconstraint": {
            "word": "Holonomic Constraint",
            "definition": "Applied constraints on position variables, such that a function of those position variables is always equal to 0. If something is holonomically constrained to move on a path, then it cannot diverge from this path at all. It's like one of those wire bead mazes in doctor's offices. A wooden piece is constrained to move completely along the path of the wire. It cannot diverge. If it can diverge from the path then it is a non-holonomic constrain.",
            "links": [
              {
                "title": "Holonomic vs. Nonholonomic Constraints for Robots | Fundamentals of Robotics | LESSON 4",
                "link": "https://www.youtube.com/watch?v=PAvj6cP6lOM&list=PLlqdnFs9xNwpD9zJr8BgAbfHH3AyixTqt&index=11&ab_channel=Mecharithm-RoboticsandMechatronics"
              },
              {
                "title": "Stackexchange - What are holonomic constraints?",
                "link": "https://math.stackexchange.com/questions/3616185/what-are-holonomic-constraints"
              },
              {
                "title": "Wikipedia - Holonomic Constraints",
                "link": "https://en.wikipedia.org/wiki/Holonomic_constraints"
              }
            ]
        },

        "implicitparametrization": {
            "word": "Implicit Parametrization",
            "definition": "Using more than n parameters to represent an n-dimensional topology or space. For example, using 3 variables (x,y,z) to represent points on a 2D surface of a sphere. You can think of using (x,y,z) to represent a 2D plane topology space as well. Imagine a 2D plane oriented in 3D space in some manner. You can choose a representation such that points on this 2D planar topology are represented with 3 variables, x, y, and z. Explicit parametrization clearly needs less variables than implicit parametrization. So what is the advantage of using implicit paramatrization and using more variables than necessary to represent a topological space? The biggest advantage is lack of singularties. These are spots in explicit representations where your coordinates/parameters can rapidly 'jump' around even though you are barely moving or stepping through your topological space. The north and south pole within the lattitude and longitude representation of the globe are a good example of this. If you are at the north pole, small steps around the pole can lead to large shifts in the coordinate space. This can cause trouble when trying to derive other values like velocities, which can start to tend to infinity when you are working within that respresentation. Implicit parametrization prevents singularities within your reference frame at the cost of more variables or parameters.",
            "links": []
        },

        "joint": {
            "word": "Joint",
            "definition": "A physical connection between two rigid bodies or links that places constraints on the motion of these rigid bodies. The joints will typically reduce the total Degrees of Freedom of a link or total mechanism.",
            "links": []
        },

        "kinematicpair": {
            "word": "Kinematic Pair",
            "definition": "A connection between two physical objects that imposes constraints on the relative movement of the objects.",
            "links": [
              {
                "title": "Wikipedia - Kinematic Pair",
                "link": "https://en.wikipedia.org/wiki/Kinematic_pair"
              }
            ]
        },

        "link": {
            "word": "Link",
            "definition": "A rigid physical body with a certain number of degrees of freedom, depending on the dimension of the space that the rigid body is contained to. For example, a rigid body constrained to move only in a plane has 3 degrees of freedom: 2 variables for position and one for orientation (angular position). In 3D, a link has 6 degrees of freedom: 3 for position and 3 for orientation. This can actually continue into an arbitrary number of dimensions, with a link in 4D space having 10 degrees of freedom: 4 variables for position and 6 for angular orientation. Links are the rigid components that form joints with each other to eventually build up a complete mechanism.",
            "links": []
        },

        "lowerpair": {
            "word": "Lower Pair",
            "definition": "A type of kinematic pair in which two links form a strong joint and are 'locked' with each other. The joints between the links place well-established constraints upon the links. The basic joints like revolute, prismatic, helical, cylindrical, universal, and spherical fall under this category.",
            "links": [
              {
                "title": "Wikipedia - Kinematic Pair",
                "link": "https://en.wikipedia.org/wiki/Kinematic_pair"
              }
            ]
        },

        "mechanism": {
            "word": "Mechanism",
            "definition": "The machine or robotic structure as a whole, including all of the links and joints.",
            "links": []
        },

        "prismaticjoint": {
            "word": "Prismatic (P) Joint",
            "definition": "A lower kinematic pair that constrains the motion of 2 objects in 3D space. A rigid body has 6 degrees of freedom in 3D space. This joint places 5 constraints on either of the rigid bodies, allowing only movement in one linear dimension. This joint is often described as a slider as one link will slide or translate itself back and forth along a single linear axis. An example of this type of joint is a hydraulic cylinder. This joint allows for 1 D.O.F.",
            "links": [
              {
                "title": "Wikipedia - Kinematic Pair",
                "link": "https://en.wikipedia.org/wiki/Kinematic_pair"
              },
              {
                "title": "Wikipedia - Prismatic Joint",
                "link": "https://en.wikipedia.org/wiki/Prismatic_joint"
              },
              {
                "title": "Picture of a Prismatic Joint",
                "link": "https://doc.comsol.com/5.6/doc/com.comsol.help.mbd/images/mbd_ug_modeling.3.08.1.png"
              }
            ]
        },

        "revolutejoint": {
            "word": "Revolute (R) Joint",
            "definition": "A lower kinematic pair that constrains the motion of 2 objects in 3D space. A rigid body has 6 degrees of freedom in 3D space. This joint places 5 constraints on either of the rigid bodies, allowing only movement in one angular dimension or orientation. Both links will only be able to rotate along a common axis and will remain in full contact to the same plane throughout these rotations. This joint allows for 1 D.O.F.",
            "links": [
              {
                "title": "Wikipedia - Kinematic Pair",
                "link": "https://en.wikipedia.org/wiki/Kinematic_pair"
              },
              {
                "title": "Wikipedia - Revolute Joint",
                "link": "https://en.wikipedia.org/wiki/Revolute_joint"
              },
              {
                "title": "Picture of a Revolute Joint",
                "link": "https://de.maplesoft.com/support/help/content/12673/image55.png"
              }
            ]
        },

        "rigidbody": {
            "word": "Rigid Body",
            "definition": "Any physical object in which three points (if you're in 3D space) within the object are a constant distance away from each other. Take a regular wooden block. The distance between 3 of the corners on the block cannot change. They are constant with each other. You can use this characteristic of a rigid body to determine that an object will have 6 degrees of freedom in 3D space. Let's assign letters, A, B, and C to 3 different corners of the wooden block. First place A at any place within 3D space. You need 3 real numbers to specify the location of A (x, y, and z). Corner B is a constant distance away from A. This constant radius traces out the surface of a sphere in 3D space. Any position on the sphere surface can be described by 2 real numbers, like lattitude and longitude. The 3 real numbers of A and 2 real numbers of B now brings us to a total of 5 independent variables used to describe the configuration of our wooden block rigid body. Finally, point C is a constant distance from point A and point B. A, B, and C form a 2D triangle in space. You can visualize the triangle side formed by C and B rotating about the axis parallel with the triangle side formed by A and B (the full rotation would trace out a cone in 3D space). Point C will trace out a circle in 3D space as it moves around B, constrained by A and B. A point on a circle can be described by a single real number, which brings our total up to 6 independent variables to describe the configuration of a rigid body in 3D space. Any attempt to continue adding more points (point D, E, etc) would be redundant as each point would add no new dimensional information. Rigid bodies will also be called links within the context of a robotic mechanism.",
            "links": []
        },

        "screw": {
            "word": "screw",
            "definition": "Simple machine with helical ridges that is used to connect and hold two rigid bodies.",
            "links": [
              {
                "title": "SCREWS: HOW THEY’RE CLASSIFIED AND HOW TO KNOW WHAT KIND TO USE",
                "link": "https://jayconsystems.com/blog/screws-how-theyre-classified-and-how-to-know-what-kind-to-use"
              }
            ]
        },

        "servo": {
            "word": "Servo",
            "definition": "A motor that is built to move within a contrained angle. For example, the motor can only move back and forth between 0 and 180 degrees. This motion is achieved by using a regular motor to drive a smart gear box. The gear box will appropriately step down the speed of the motor and only allow motion through the predefined angular range. Servo motors typically have three wires: power, ground, and a control line. Power and ground are there to provide the necessary current needed for operation of the servo. The control signal typically carries PWM signals as an input. The duty cycle of the PWM signal is decoded by the servo and the servo is moved to the appropriate angle corresponding to this decoded duty cycles (e.g. 0% duty cycle = 0 degrees, 100% = 180 degrees). The torque and defined motion of these devices make them very useful in robotics.",
            "links": [
              {
                "title": "The Secret Life of Servos Playlist",
                "link": "https://www.youtube.com/watch?v=LwMybZOhtAw&list=PLHj0bn3rsCbROgyLfOHBrLirTMhpUg62o&ab_channel=ServoCity"
              },
              {
                "title": "How to Determine what Torque you need for your Servo Motors.",
                "link": "https://automaticaddison.com/how-to-determine-what-torque-you-need-for-your-servo-motors/"
              }
            ]
        },

        "sphericaljoint": {
            "word": "Spherical (S) Joint",
            "definition": "Also known as a 'Ball-And-Socket' joint, it is a lower kinematic pair that constrains the motion of two rigid bodies in 3D space. A rigid body has 6 degrees of freedom in 3D space. This joint places 3 constraints on either link, allowing movement in two orthogonal linear dimensions and one angular dimension. The constrained body will trace out a hemisphere. This joint allows for 3 D.O.F., as it requires 3 independent variables to describe the full range of motion",
            "links": [
              {
                "title": "Wikipedia - Kinematic Pair",
                "link": "https://en.wikipedia.org/wiki/Kinematic_pair"
              },
              {
                "title": "Wikipedia - Ball Joint",
                "link": "https://en.wikipedia.org/wiki/Ball_joint"
              },
              {
                "title": "GIF of Spherical Joint in motion",
                "link": "https://d2t1xqejof9utc.cloudfront.net/screenshots/pics/2e21294fb1fd1c7759817d734021d3a6/large.gif"
              },
              {
                "title": "this thing is freaking sick",
                "link": "https://www.youtube.com/watch?v=AHUv9Zda_48&ab_channel=MDxmedia"
              }
            ]
        },

        "topology": {
            "word": "Topology",
            "definition": "The intrinsic 'shape' of a space. It is independent of the representation that we choose to apply. For example, take a circle as our topological space. We can choose to represent a position on the circle with a single value: an angle. Or we can represent the position with two values, a constrained horizontal and vertical position, x and y (x^2 + y^2 = R). Regardless of the representation we choose to view the topological space of the circle in, it is still a circle. Topological spaces are said to be equivalent if you can continuously stretch or deform a topological space into another without cutting or gluing. A sphere could be turned into an ellipsoid with just some stretching so a sphere and an ellipsoid are equivalent topologically. However, a sphere could never be turned into a torus or 2D plane topology without cutting, gluing, and adding discontinuities, so those topologies are not the same. Why do we care about this? The topology and the representation we choose to apply are important because the C-space has a topology. Understanding the topology and choosing the appropriate representation will allow us to work more effectively within the C-space and help us to better understand the possible set of configurations that our robotic mechanism can take on.",
            "links": [
              {
                "title": "Wikipedia - Kinematic Pair",
                "link": "https://en.wikipedia.org/wiki/Topology"
              }
            ]
        },

        "universaljoint": {
            "word": "Universal (U) Joint",
            "definition": "A lower kinematic pair that constrains the motion of two rigid bodies in 3D space. A rigid body has 6 degrees of freedom in 3D space. This joint places 4 constraints on either link, allowing movement in two orthogonal linear dimensions. You can think of this joint as an orthogonal combination of two revolute joints. This joint allows for 2 D.O.F.",
            "links": [
              {
                "title": "Wikipedia - Kinematic Pair",
                "link": "https://en.wikipedia.org/wiki/Kinematic_pair"
              },
              {
                "title": "Wikipedia - Universal Joint",
                "link": "https://en.wikipedia.org/wiki/Universal_joint"
              },
              {
                "title": "GIF of Universal Joint in motion",
                "link": "http://4.bp.blogspot.com/-_b857g8j_dI/UhSeE2TylfI/AAAAAAAABNA/07phnoUR8RI/s1600/uj3.gif"
              }
            ]
        }
    }
}
