{
  "terms":
    {
        "asset": {
            "word": "Asset",
            "definition": "Something of monetary value that is owned by a company. A company can have tangible assets like trucks, raw meterials, or machinery. It can also have intangible assets like patents. The amount of assets a company currently owns, minus the debt that it owes, essentially tells you how much the company is currently worth.",
            "links": [
              {
                "title": "Investopedia - Asset",
                "link": "https://www.investopedia.com/terms/a/asset.asp"
              },
              {
                "title": "BeginToInvest - Assets",
                "link": "https://www.begintoinvest.com/definitions/assets/"
              }
            ]
        },

        "balancesheet": {
            "word": "Balance Sheet",
            "definition": "A financial document that tells you what a company owns (Total Assets) and what a company owes (Total Liabilities/Debt). The balance sheet can also tell you Total Equity and the amount of common or preferred shares outstanding. Make sure you look closely at this document. Pay attention to things that the company considers assets and liabilities and how they break down the total value of those items. Companies love to fudge numbers to make themselves look better, but there may also be extraordinary items or exceptions only pertinent to that the time block you are looking at. Companies in the U.S. are required by law to disclose this information to the SEC every quarter. This is one of the 'Big 3' financial documents. The other two are the Income Statement and Cash Flow.",
            "links": [
              {
                "title": "Investopedia - Balance Sheet",
                "link": "https://www.investopedia.com/terms/b/balancesheet.asp"
              },
              {
                "title": "Investopedia - Reading the Balance Sheet",
                "link": "https://www.investopedia.com/articles/04/031004.asp"
              },
              {
                "title": "BeginToInvest - Balance Sheet",
                "link": "https://www.begintoinvest.com/definitions/balance-sheet/"
              }
            ]
        },

        "bearmarket": {
            "word": "Bear Market",
            "definition": "A bear market is a period of cynicism in which prices of a security or asset are expected to, and usually do, fall significantly over time. If someone is cynical about the future price action of a security or asset, they are said to be 'bearish' about that particular asset.",
            "links": []
        },

        "bullmarket": {
            "word": "Bull Market",
            "definition": "A bull market is a period of optimism in which prices of a security or asset are expected to, and usually do, rise significantly over time. If someone is optimistic about the future price action of a security or asset, they are said to be 'bullish' about that particular asset.",
            "links": []
        },

        "corporatebond": {
            "word": "Corporate Bond",
            "definition": "Bonds sold by corporations in an effort to raise capital quickly to fund big projects. These bonds have a maturity, which is the time a company has before the principal of the sold bonds must be paid back to investors. These bonds also have interest payments, called coupon payments. They can be fixed, floating, etc. A major characteristic about corporate bonds is their grade. The credit quality of the companies and the bonds they offer are periodically evaluated by credit rating agencies. These agencies classify the bonds as investment grade or non-investment grade. The grade is based on how likely a company is to default on its payments to the investors.",
            "links": [
              {
                "title":"Investor.gov - Corporate Bonds",
                "link":"https://www.investor.gov/introduction-investing/investing-basics/investment-products/bonds-or-fixed-income-products"
              }
            ]
        },

        "corporatedebt": {
            "word": "Corporate Debt",
            "definition": "Can refer to either general long-term debt a company owns from loans or corporate bonds.",
            "links": []
        },

        "debttoequityratio": {
          "word": "Debt-to-Equity Ratio",
          "definition":  "You can calulate this from the balance sheet. Subtract your Liabilities from your Assets to get your Equity in dollars. Then divide the Liabilities by the Equity amount. This is the debt-to-equity ratio and tells you how leveraged (how much of the company's operations are being financed through debt) a company is. A high debt-to-equity ratio means that a company is highly leveraged. They have a lot of debt and not as much in assets. This makes the company more risky to invest in. If a company has a low debt-to-equity ratio, this means it is less risky to invest in.",
          "links": [
            {
              "title": "Investopedia - Debt-to-Equity (D/E) Ratio",
              "link": "https://www.investopedia.com/terms/d/debtequityratio.asp"
            },
            {
              "title": "Investopedia - Leverage",
              "link": "https://www.investopedia.com/terms/l/leverage.asp"
            }
          ]
        },

        "equity": {
            "word": "Equity",
            "definition": "How much a company is worth if it were to liquidate all of it's assets and pay off all of its debt.",
            "links": []
        },

        "growthstock": {
            "word": "Growth Stock",
            "definition": "A stock that is expected to grow much more rapidly than the market average. Money made is invested right back into the company in an effort to continually increase a stock's price. When you put your money into growth stocks, you are trying to make money from capital gains rather than through dividends.",
            "links": [
              {
                "title": "Investopedia: What is a Growth Stock?",
                "link" : "https://www.investopedia.com/terms/g/growthstock.asp"
              }
            ]
        },

        "incomestatement": {
            "word": "Income statement",
            "definition": "A financial document that tells you how much profit a company generated over a certain time period and what it cost the company to generate that profit. It breaks down information like Revenue, Liabilities (debt), Gross Profit, and Net Income. There is a sort of flow when it comes to looking at the Income Statement. You start with the Total Revenue and from that you can subtract the Total Cost of Revenue to get the Gross Profit. Then you can subtract the Total Operating Expense from the Gross profit to get the Total Operating Income. Companies in the U.S. are required by law to disclose this information to the SEC every quarter. This is one of the 'Big 3' financial documents. The other two are the Balance Sheet and Cash Flow.",
            "links": [
              {
                "title": "Investopedia - Balance Sheet",
                "link": "https://www.investopedia.com/terms/b/balancesheet.asp"
              },
              {
                "title": "Investopedia - Reading the Balance Sheet",
                "link": "https://www.investopedia.com/articles/04/031004.asp"
              },
              {
                "title": "BeginToInvest - Balance Sheet",
                "link": "https://www.begintoinvest.com/definitions/balance-sheet/"
              }
            ]
        },

        "netincome": {
            "word": "Net Income",
            "definition": "The total amount of money that a company brings in after both expenses and taxes have been subtracted from revenue.",
            "links": []
        },

        "pricetoearningsratio": {
            "word": "Price-to-Earnings (P/E) Ratio",
            "definition": "The current price of a share divided by a company's current earnings-per-share (EPS). This ratio tells you how undervalued or overvalued a stock appears to be. You can think of it as how much money a stock brings in (EPS) versus how much it will cost to buy one share (current stock price). Is it worth it to buy this stock at this price if it's only brining in so much earnings? If you have a high P/E ratio, that implies that the stock's current price is pretty high aand the earnings per share are on the smaller side. You can think of this stock as being very overvalued because it's not bringing in enough earnings to justify the high cost of the stock. With a low P/E ratio, a stock is most likely low in price and bringing in a lot of earnings. This implies that the stock is undervalued, as you can pay very little for the stock and expect a lot of earnings to come in. Beware, this ratio is not as straightforward as it seems and you should not solely use it as an indication that a stock is a good or bad investment. In fact, William J Oneill's financial models in 'How to Make Money in Stocks' indicated that P/E ratio actually carries very little weight in predicting breakouts of stocks.",
            "links": []
        },

        "relativepricestrength": {
            "word": "Relative Price Strength",
            "definition": "The ratio of stock performance to a market average (index) performance. To calculate the relative strength of a particular stock, divide the price percentage change over some time period by the percentage change in price of a particular index over that same time period. Don't confuse this with the Relative Strength Index.",
            "links": [
              {
                "title": "Investopedia - Relative Strength",
                "link": "https://www.investopedia.com/terms/r/relativestrength.asp"
              }
            ]
        },

        "revenue": {
            "word": "Revenue",
            "definition": "The total amount of money that a company brings in before the cost of making that money is taken into account. A company could have made $12 million this quarter in revenue, but if it cost $3 million in raw material and $2 million in advertising to generate that revenue, then the company will only bring in $7 million in profit (a.k.a gross profit on the income statement).",
            "links": []
        },

        "roa": {
            "word": "Return on Assets (ROA)",
            "definition": "Defined as the business's net income divided by the companies current assets. You can also multiply by 100 to get a percentage. This tells you how efficiently the company is using it's assets to generate a profit. Let's say company 1 and company 2 both make the same net income for this quarter: $50 million. However, company 1 only has $10 million in assets, while company 2 has $40 million in assets. This means that company 1 only needed a quarter of what company 2 needed in assets in order to generate the same $50 million that company 2 generated. Company 1 is much more efficient and effective at using it's assets to generate profit.",
            "links": []
        },

        "roe": {
            "word": "Return on Equity (ROE)",
            "definition": "Defined as the business's net income divided by the companies current equity. You can also multiply by 100 to get a percentage. This tells you how efficiently the company is using it's assets to generate a profit. Let's say company 1 and company 2 both make the same net income for this quarter: $50 million. However, company 1 only has $10 million in assets, while company 2 has $40 million in assets. This means that company 1 only needed a quarter of what company 2 needed in assets in order to generate the same $50 million that company 2 generated. Company 1 is much more efficient and effective at using it's assets to generate profit.",
            "links": []
        },

        "sharesoutstanding": {
          "word": "Shares Outstanding",
          "definition":  "All of the shares of the company. This includes shares owned by the general public/investors and restricted stock owned by company officers and management.",
          "links": [
            {
              "title": "Investopedia - Shares Outstanding",
              "link": "https://www.investopedia.com/terms/o/outstandingshares.asp"
            },
            {
              "title": "Investopedia - Outstanding Vs Floating Stock: What's the Difference?",
              "link": "https://www.investopedia.com/ask/answers/062315/what-difference-between-shares-outstanding-and-floating-stock.asp"
            }
          ]
        }
    }
}
